KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB05.svd
        <register>
          <name>LCKR</name>
          <displayName>LCKR</displayName>
          <description>LCKR register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LCK0</name>
              <description>LCK0: Port B lock bit 0
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK1</name>
              <description>LCK1: Port B lock bit 1
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK2</name>
              <description>LCK2: Port B lock bit 2
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK3</name>
              <description>LCK3: Port B lock bit 3
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK4</name>
              <description>LCK4: Port B lock bit 4
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK5</name>
              <description>LCK5: Port B lock bit 5
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK6</name>
              <description>LCK6: Port B lock bit 6
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK7</name>
              <description>LCK7: Port B lock bit 7
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK12</name>
              <description>LCK12: Port B lock bit 12
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK13</name>
              <description>LCK13: Port B lock bit 13
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK14</name>
              <description>LCK14: Port B lock bit 14
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK15</name>
              <description>LCK15: Port B lock bit 15
These bits are read/write but can only be written when the LCKK bit is 0, using the specific
sequence described in LCKK bit description.
-0: Port configuration not locked 
-1: Port configuration locked</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCKK</name>
              <description>LCKK: Lock key
This bit can be read any time. It can only be modified using the lock key write sequence.
-0: Port configuration lock key not active 
-1: Port configuration lock key active. The GPIOx_LCKR register is locked until the next MCU
reset or peripheral reset.
LOCK key write sequence:
WR LCKR[16] = 1' + LCKR[15:0]
WR LCKR[16] = 0' + LCKR[15:0]
WR LCKR[16] = 1' + LCKR[15:0]
RD LCKR
RD LCKR[16] = 1' (this read operation is optional but it confirms that the lock is active)
Note: During the LOCK key write sequence, the value of LCK[15:0] must not change.
Any error in the lock sequence aborts the lock.
After the first lock sequence on any bit of the port, any read access on the LCKK bit will
return 1' until the next MCU reset or peripheral reset.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <displayName>AFRL</displayName>
          <description>AFRL register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 0..7)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <displayName>AFRH</displayName>
          <description>AFRH register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AFSEL12</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>y[3:0]: Alternate function selection for port B pin y (y = 8..15)
These bits are written by software to configure alternate function I/Os
AFSELy selection:
-0000: AF0
-0001: AF1
-0010: AF2
-0011: AF3
-0100: AF4
-0101: AF5
-0110: AF6
-0111: AF7
1xxx: Reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <displayName>BRR</displayName>
          <description>BRR register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BR0</name>
              <description>BR0: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR1</name>
              <description>BR1: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR2</name>
              <description>BR2: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR3</name>
              <description>BR3: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR4</name>
              <description>BR4: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR5</name>
              <description>BR5: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR6</name>
              <description>BR6: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR7</name>
              <description>BR7: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR12</name>
              <description>BR12 Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR13</name>
              <description>BR13: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR14</name>
              <description>BR14: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BR15</name>
              <description>BR15: Port B reset bit y (y = 0..15)
These bits are write-only. A read to these bits returns the value 0x0000.
-0: No action on the corresponding ODx bit 
-1: Resets the corresponding ODx bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
