KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32WB05.svd
        <register>
          <name>STATUS2REG</name>
          <displayName>STATUS2REG</displayName>
          <description>STATUS2REG register</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IQSAMPLESREADY</name>
              <description>indicates if IQ samples have been received on the last reception.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IQSAMPLESNUMBER</name>
              <description>indicate the number of IQ samples stored in the RAM buffer addressed by StatMach.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IQSAMPLESMISSINGERROR</name>
              <description>IQ sample internal buffer overflow error flag.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANTENNASWITCHINGPATTERNACCESSERROR</name>
              <description>timing error flag related to Antenna Pattern not read on-time.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANTENNA_SWITCHING_PATTERN_ADDRESS_ERROR</name>
              <description>AHB access error flag.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBALSTATMACH_REG</name>
      <groupName>GLOBALSTATMACH_REG_BLOCK</groupName>
      <baseAddress>0x200000C0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WORD0</name>
          <displayName>WORD0</displayName>
          <description>WORD0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RadioConfigPtr</name>
              <description>Radio Configuration address Pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD1</name>
          <displayName>WORD1</displayName>
          <description>WORD1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CurStMachNum</name>
              <description>current connection machine number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Active</name>
              <description>Must be at '1' when the trig event (Wakeup Timer, Timer1 or Timer2) occurs to starts a Bluetooth LE link layer sequence.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WakeupInitDelay</name>
              <description>Delay between wakeup timer trig event on Sequencer and RX/TX request sending to the Radio FSM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Timer12InitDelayCal</name>
              <description>Delay between Timer1 or Timer2 trig event on Sequencer and RX/TX request sending to the Radio FSM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Timer2InitDelayNoCal</name>
              <description>Delay between Timer2 trig event on Sequencer and RX/TX request sending to the Radio FSM.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD2</name>
          <displayName>WORD2</displayName>
          <description>WORD2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TransmitCalDelayChk</name>
              <description>Delay between TX request sent to the Radio FSM and the start pulse sent to the transmit block.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TransmitNoCalDelayChk</name>
              <description>Delay between TX request sent to the Radio FSM and the start pulse to the transmit block.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ReceiveCalDelayChk</name>
              <description>Delay between RX request sent to the Radio FSM and the start pulse sent to the receive block.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ReceiveNoCalDelayChk</name>
              <description>Delay between RX request sent to the Radio FSM and the start pulse to the receive block.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD3</name>
          <displayName>WORD3</displayName>
          <description>WORD3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ConfigEndDuration</name>
              <description>Duration for the Sequencer to execute the final configuration.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxdataReadyCheck</name>
              <description>Duration for the Sequencer to get the TxDataReady and DataPtr information in TxRxPack table.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxdelayStart</name>
              <description>Delay added between the moment the Radio FSM is in TX mode (PA ramp up done and power present on the antenna) and the first bit transmission to the modulator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TxdelayEnd</name>
              <description>Delay added between the last bit transmission to the modulator and the end of transmission information for the Sequencer.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TimeCaptureSel</name>
              <description>- 0: the captured time (absolute time) corresponds to the end of 1st INIT step in the sequence (InitDelay timeout event).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TimeCapture</name>
              <description>- 0: No capture is requested to monitor the Bluetooth LE sequence.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD4</name>
          <displayName>WORD4</displayName>
          <description>WORD4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TxReadyTimeout</name>
              <description>Transmission ready timeout.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RcvTimeout</name>
              <description>Receive window timeout.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD5</name>
          <displayName>WORD5</displayName>
          <description>WORD5 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AutoTxRxskipEn</name>
              <description>Automatic transfer (TX or RX) skip enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ChkFlagAutoClearEna</name>
              <description>Active bit Auto Clear Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntAddPointError</name>
              <description>Address pointer error interrupt enable.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntAllTableReadyError</name>
              <description>All table ready error interrupt enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntTxDataReadyError</name>
              <description>Transmission data payload ready error interrupt enable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntNoActiveLError</name>
              <description>Active bit low value reading interrupt enable.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntRcvLengthError</name>
              <description>Too long received payload length interrupt enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntSemaTimeoutError</name>
              <description>Semaphore timeout error interrupt enable.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntSeqDone</name>
              <description>Sequencer end of task interrupt enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>intTxRxSkip</name>
              <description>Transmission or reception skip interrupt enable.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntActive2Err</name>
              <description>not in ACTIVE2 information from Radio FSM received on time interrupt enable.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IntConfigError</name>
              <description>Configuration error interrupt enable.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WORD6</name>
          <displayName>WORD6</displayName>
          <description>WORD6 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DefaultAntennaID</name>
              <description>Default Antenna ID corresponding to the number of the antenna used to receive/transmit:
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
